Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawProfileRoof Property
 Can't make footprint roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawProfileRoof { get; }
Public Shared ReadOnly Property CannotDrawProfileRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawProfileRoof {
	FailureDefinitionId^ get ();
}
static member CannotDrawProfileRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace